/**
  ******************************************************************************
  * @file    Project/HARDWARE/motor.c
  * @author  Siyuan Qiao&Junyu Luo
  * @version V1.0.0
  * @date    1.2021
  * @brief
  ******************************************************************************
  * @attention
  ******************************************************************************
	// * 范围  ：3508  数据范围                       金属头转速为0.22rps,即13.3rpm
//						给定电流 -16384 ~ 0 ~ +16384
//						转子角度	0~8191 等价	0-360°
//						转子转速	max=450	RPM
//						实际转矩电流
//						电机温度
//			   ：GM6020数据范围
//						给定电压 -30000 ~ 0 ~ +30000
//						转子角度	0~8191 等价	0-360°
//						转子转速	max=350	RPM
//						实际转矩电流
//						电机温度
//			   ：P2006 数据范围
//						给定电流 -10000 ~ 0 ~ +10000
//						转子角度	0~8191 等价	0-360°
//						转子转速	max=450	RPM
//						实际输出转矩
      ..................NEUQ_SUDO..................

*/




